src/Documents/ОперацияМеждународный/ОперацияМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияМеждународный</name>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.МеждународныйБезКорреспонденции</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьПериодПоСтрокам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаполнениеДвижений</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ВнутреннееПотребление</types>
        <types>DocumentRef.ПодготовкаКПередачеНМА</types>
        <types>DocumentRef.СписаниеОС</types>
        <types>DocumentRef.ЗаписьКнигиПокупок</types>
        <types>DocumentRef.АмортизацияОСМеждународныйУчет</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПередачаДавальцу</types>
        <types>DocumentRef.ПеремещениеМатериаловВПроизводстве</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПереоценкаНМА2_4</types>
        <types>DocumentRef.ПередачаОСВАренду</types>
        <types>DocumentRef.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
        <types>DocumentRef.СчетФактураПолученныйАванс</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ПоступлениеУслугПоАренде</types>
        <types>DocumentRef.ИнойДокументПодтвержденияНДС</types>
        <types>DocumentRef.ЭтапПроизводства2_2</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ОтчетДавальцу</types>
        <types>DocumentRef.ПодготовкаКПередачеНМА2_4</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.Бронирование</types>
        <types>DocumentRef.АмортизацияНМА</types>
        <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
        <types>DocumentRef.РасчетКурсовыхРазниц</types>
        <types>DocumentRef.ПоступлениеСырьяОтДавальца</types>
        <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.СписаниеОС2_4</types>
        <types>DocumentRef.ИзменениеПараметровОС2_4</types>
        <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</types>
        <types>DocumentRef.ВводОстатковДенежныхСредств</types>
        <types>DocumentRef.ОперацияБух</types>
        <types>DocumentRef.РегламентнаяОперацияМеждународныйУчет</types>
        <types>DocumentRef.АмортизацияНМАМеждународныйУчет</types>
        <types>DocumentRef.ВозвратОСИзАренды2_4</types>
        <types>DocumentRef.ОбесценениеВНА</types>
        <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
        <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
        <types>DocumentRef.ПринятиеКУчетуОСМеждународныйУчет</types>
        <types>DocumentRef.ОбъединениеОС</types>
        <types>DocumentRef.ПрочиеДоходыРасходы</types>
        <types>DocumentRef.ИзменениеПараметровНМАМеждународныйУчет</types>
        <types>DocumentRef.ОперацияМеждународный</types>
        <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.СчетФактураВыданныйАванс</types>
        <types>DocumentRef.ВводОстатковОСМеждународныйУчет</types>
        <types>DocumentRef.ВводОстатковНМАМеждународныйУчет</types>
        <types>DocumentRef.КорректировкаНалогообложенияНДСПартийТоваров</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.СписаниеНМАМеждународныйУчет</types>
        <types>DocumentRef.ПеремещениеОС2_4</types>
        <types>DocumentRef.ПеремещениеНМАМеждународныйУчет</types>
        <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
        <types>DocumentRef.РазукомплектацияОС</types>
        <types>DocumentRef.МодернизацияОС</types>
        <types>DocumentRef.ПогашениеСтоимостиТМЦВЭксплуатации</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.МодернизацияОС2_4</types>
        <types>DocumentRef.СписаниеНДСНаРасходы</types>
        <types>DocumentRef.СписаниеНедостачТоваров</types>
        <types>DocumentRef.РаспределениеПрочихЗатрат</types>
        <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ВозвратСырьяДавальцу</types>
        <types>DocumentRef.ПодготовкаКПередачеОС2_4</types>
        <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
        <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ПереоценкаОС2_4</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.Сторно</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
        <types>DocumentRef.АмортизацияОС</types>
        <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
        <types>DocumentRef.ПодготовкаКПередачеОС</types>
        <types>DocumentRef.ПересортицаТоваровУХранителя</types>
        <types>DocumentRef.ВводОстатковНДСПредъявленного</types>
        <types>DocumentRef.РасчетРезервовПодОбесценениеЗапасов</types>
        <types>DocumentRef.ПоступлениеАрендованныхОС</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
        <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
        <types>DocumentRef.ПереоценкаНМА</types>
        <types>DocumentRef.ПередачаСырьяПереработчику</types>
        <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
        <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
        <types>DocumentRef.КорректировкаНазначенияТоваров</types>
        <types>DocumentRef.ПересортицаТоваров</types>
        <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
        <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
        <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.НачислениеДивидендов</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.СчетФактураВыданный</types>
        <types>DocumentRef.ОтчетКомитентуОСписании</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
        <types>DocumentRef.ПереоценкаОС</types>
        <types>DocumentRef.ПеремещениеОСМеждународныйУчет</types>
        <types>DocumentRef.ПеремещениеНМА2_4</types>
        <types>DocumentRef.АмортизацияНМА2_4</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АннулированиеПодарочныхСертификатов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.СписаниеНМА2_4</types>
        <types>DocumentRef.ОтчетДавальцу2_5</types>
        <types>DocumentRef.ВводОстатковПоФинансовымИнструментам</types>
        <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
        <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
        <types>DocumentRef.ИзменениеПараметровОС</types>
        <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
        <types>DocumentRef.КорректировкаСтоимостиИАмортизацииОС</types>
        <types>DocumentRef.ОтчетОРозничныхВозвратах</types>
        <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
        <types>DocumentRef.СборкаТоваров</types>
        <types>DocumentRef.ПриемкаТоваровНаХранение</types>
        <types>DocumentRef.СписаниеОСМеждународныйУчет</types>
        <types>DocumentRef.ОтчетОСписанииТоваровУХранителя</types>
        <types>DocumentRef.ПроизводствоБезЗаказа</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.АмортизацияОС2_4</types>
        <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
        <types>DocumentRef.ВводОстатковТоваров</types>
        <types>DocumentRef.ВыкупАрендованныхОС</types>
        <types>DocumentRef.ВводОстатковПрочиеРасходы</types>
        <types>DocumentRef.ПринятиеКУчетуНМАМеждународныйУчет</types>
        <types>DocumentRef.СчетФактураКомиссионеру</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
        <types>DocumentRef.ВозвратОСИзАренды</types>
        <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
        <types>DocumentRef.РегламентнаяОперация</types>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
        <types>DocumentRef.ДепонированиеЗарплаты</types>
        <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
        <types>DocumentRef.РасчетСебестоимостиТоваров</types>
        <types>DocumentRef.СчетФактураПолученный</types>
        <types>DocumentRef.ПрочееОприходованиеТоваров</types>
        <types>DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</types>
        <types>DocumentRef.НачисленияКредитовИДепозитов</types>
        <types>DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</types>
        <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
        <types>DocumentRef.ИзменениеПараметровОСМеждународныйУчет</types>
        <types>DocumentRef.ЗаписьКнигиПродаж</types>
        <types>DocumentRef.ПеремещениеОС</types>
        <types>DocumentRef.ОтчетПереработчика2_5</types>
        <types>DocumentRef.ПризнаниеРасходовПоИсследованиямИРазработкам</types>
        <types>DocumentRef.ВозвратПодарочныхСертификатов</types>
        <types>DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ВыкупТоваровХранителем</types>
        <types>DocumentRef.ПередачаОСВАренду2_4</types>
        <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
        <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
        <types>DocumentRef.ВводОстатковРасчетовПоЭквайрингу</types>
        <types>DocumentRef.ПринятиеКУчетуНМА</types>
        <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
        <types>DocumentRef.ВводОстатковСПодотчетниками</types>
        <types>DocumentRef.ПорчаТоваров</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
        <types>DocumentRef.СписаниеНМА</types>
        <types>DocumentRef.ВыбытиеАрендованныхОС</types>
        <types>DocumentRef.СчетФактураНалоговыйАгент</types>
        <types>DocumentRef.ЗаключениеДоговораАренды</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете2_5</types>
        <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
        <types>DocumentRef.РаспределениеНДС</types>
        <types>DocumentRef.ОтчетКомитентуОЗакупках</types>
        <types>DocumentRef.ВводОстатковПрочихАктивовПассивов</types>
        <types>DocumentRef.ОтчетДавальцуМеждуОрганизациями</types>
        <types>DocumentRef.ПорчаТоваровУХранителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ОперацияМеждународный/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ТекущаяОрганизация", "");
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Основание")
			И ДанныеЗаполнения.Свойство("ПланСчетов") Тогда
		МетаданныеОснования = Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаполнения.Основание));
		Если Метаданные.Документы.Найти(МетаданныеОснования.Имя) <> Неопределено Тогда
			ПланСчетов = ДанныеЗаполнения.ПланСчетов;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Основание,,"Дата,Номер");
			Комментарий = "";
			
			НастройкаФормированияПроводок = МеждународныйУчетСерверПовтИсп.ИспользуемаяНастройкаФормированияПроводок(
				НачалоМесяца(ТекущаяДатаСеанса()), ПланСчетов, Организация);
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаФормированияПроводок, "СпособАннулированияПроводок")
				= Перечисления.СпособыАннулированияПроводокМеждународногоУчета.РеверсивнымиПроводками Тогда
				СодержаниеОперации = НСтр("ru = 'Реверс';
											|en = 'Reverse'", ОбщегоНазначения.КодОсновногоЯзыка()) + " " + Строка(ДанныеЗаполнения.Основание);
			Иначе
				СодержаниеОперации = НСтр("ru = 'Сторно';
											|en = 'Storno'", ОбщегоНазначения.КодОсновногоЯзыка()) + " " + Строка(ДанныеЗаполнения.Основание);
			КонецЕсли;
			
			НоваяСтрока = ЭтотОбъект.ЗаполнениеДвижений.Добавить();
			НоваяСтрока.Документ = ДанныеЗаполнения.Основание;
			
			ПроводкиСторно = РегистрыБухгалтерии.Международный.ПроводкиСторно(ДанныеЗаполнения.Основание,
				ДанныеЗаполнения.ПланСчетов, ТекущаяДатаСеанса());
			
			Проводки = Движения.Международный;
			Для Каждого Проводка Из ПроводкиСторно Цикл
				НоваяПроводка = Проводки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка);
				НоваяПроводка.Активность = Ложь;
				Проводки.УстановитьСубконто(НоваяПроводка, Проводка, "Дт");
				Проводки.УстановитьСубконто(НоваяПроводка, Проводка, "Кт");
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		
		ТипыДокументаОснования = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).ТабличныеЧасти.ЗаполнениеДвижений.Реквизиты.Документ.Тип;
		
		Для каждого ДокументЗаполнения Из ДанныеЗаполнения Цикл
			
			Если ТипыДокументаОснования.СодержитТип(ТипЗнч(ДокументЗаполнения)) Тогда
				
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументЗаполнения,,"Дата,Номер,Проведен");
				НачалоСодержания = ?(СодержаниеОперации = "", НСтр("ru = 'КОРРЕКТИРОВКА:';
																	|en = 'ADJUSTMENT:'") + " ", СодержаниеОперации + ", ");
				Комментарий = "";
				Содержание = НачалоСодержания + Строка(ДокументЗаполнения);
				НоваяСтрока = ЗаполнениеДвижений.Добавить();
				НоваяСтрока.Документ = ДокументЗаполнения;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПланСчетов) Тогда
		ПланСчетов = Справочники.ПланыСчетовМеждународногоУчета.ПланСчетовПоУмолчанию();
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ВводитьПериодПоСтрокам Тогда
		Движения.Международный.ДополнительныеСвойства.Вставить("ВводитьПериодПоСтрокам", ВводитьПериодПоСтрокам);
	КонецЕсли;
	// Заполнение реквизитов регистров Период, Организация
	Для каждого НаборЗаписей Из Движения Цикл
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПустаяТаблица   = НаборЗаписей.ВыгрузитьКолонки(); // ТаблицаЗначений - 
		ЕстьПланСчетов  = ПустаяТаблица.Колонки.Найти("ПланСчетов") <> Неопределено;
		ЕстьОрганизация = ПустаяТаблица.Колонки.Найти("Организация") <> Неопределено;
		ЕстьПериод      = ПустаяТаблица.Колонки.Найти("Период") <> Неопределено;
		
		Если НЕ (ЕстьОрганизация ИЛИ ЕстьПериод ИЛИ ЕстьПланСчетов) Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДвижений = НаборЗаписей.Выгрузить();
		Если ЕстьПланСчетов Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(ПланСчетов, "ПланСчетов");
		КонецЕсли;
		Если ЕстьОрганизация Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		КонецЕсли;
		Если ЕстьПериод И НЕ ВводитьПериодПоСтрокам Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Дата, "Период");
		КонецЕсли;
		НаборЗаписей.Загрузить(ТаблицаДвижений);
	
	КонецЦикла;
	
	УстановитьАктивностьДвижений(РежимЗаписи);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();
	
	Набор = ОбъектКопирования.Движения.Международный;
	Набор.Прочитать();
	НаборТекущегоОбъекта = Движения.Международный;
	Если Набор.Количество() > 0 Тогда
		
		Для Каждого ЗаписьНабора Из Набор Цикл
			
			НоваяЗапись = НаборТекущегоОбъекта.Добавить();
			НоваяЗапись.Период = Дата;
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНабора,,"Период,Регистратор,СубконтоДт,СубконтоКт");
			НоваяЗапись.Активность = Ложь;
			
			Для Каждого Субконто Из ЗаписьНабора.СубконтоДт Цикл
				НоваяЗапись.СубконтоДт[Субконто.Ключ] = Субконто.Значение;
			КонецЦикла;
			
			Для Каждого Субконто Из ЗаписьНабора.СубконтоКт Цикл
				НоваяЗапись.СубконтоКт[Субконто.Ключ] = Субконто.Значение;
			КонецЦикла;
			
		КонецЦикла;// по записям набора
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьАктивностьДвижений(РежимЗаписи)
	
	Активность = РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись И Проведен;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Движение Из Движения Цикл
		
		Если Движение.Записывать = Ложь Тогда // При работе формы набор может быть уже "потроган" (прочитан, модифицирован)
			// Набор никто не трогал
			Движение.Прочитать();
		КонецЕсли;
		
		Для Каждого Строка Из Движение Цикл
			
			Если Строка.Активность = Активность Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.Активность   = Активность;
			Движение.Записывать = Истина; // На случай, если набор был прочитан выше
			
		КонецЦикла;
		
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Движение.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
